---
type: RebarShapeConstraintAngleFromFixedDir
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 3
tags: [revit-api, class]
---

# RebarShapeConstraintAngleFromFixedDir

`Autodesk.Revit.DB.Structure.RebarShapeConstraintAngleFromFixedDir` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | RebarShapeConstraintAngleFromFixedDir | 2012 | `public RebarShapeConstraintAngleFromFixedDir ( ElementId paramId , int sign , UV direction )` |
| Property | Direction | 2012 | `public UV Direction { get ; set ; }` |
| Property | Sign | 2012 | `public int Sign { get ; set ; }` |